Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This function only adds the sound to the group, but it does not play the sound, and will be a value > -1 if it succeeds and -1 if it fails, where a successful value indicates the sounds order in the sync group (so 0 would be the first sound added, 1 would be the second, etc...).
zh_cn: 此函数只将声音添加到组中，但不播放声音，如果成功，则值为> -1，如果失败，则值为-1，其中成功值表示同步组中声音的顺序(因此0将是第一个添加的声音，1将是第二个，等等)。

source: This function opens a dialogue and asks the player for a filename to open with the given filter.
zh_cn: 此函数打开一个对话框，要求玩家输入一个文件名，用给定的过滤器打开。

source: This function opens a dialogue and asks the player for a filename to save to with the given filter.
zh_cn: 此函数打开一个对话框，要求玩家用给定的过滤器保存文件名。

source: This function opens a window and displays message as well as a space for the user to input a string (which will contain the supplied default string to start with).
zh_cn: 此函数打开一个窗口并显示消息和一个空格，供用户输入字符串(其中将包含提供的默认字符串作为开始)。

source: This function opens a window and displays message as well as a space for the user to input a value (which will contain the supplied default value to start with).
zh_cn: 此函数打开一个窗口并显示消息和一个空格，供用户输入值(其中将包含提供的初始默认值)。

source: This function opens a window and displays the message you define in the function to the user.
zh_cn: 此函数打开一个窗口，并将您在函数中定义的消息显示给用户。

source: This function opens a window and displays the question you define in the function to the user.
zh_cn: 此函数打开一个窗口，并向用户显示在函数中定义的问题。

source: This function opens a window that asks the user to input a username and password.
zh_cn: 此函数打开一个窗口，要求用户输入用户名和密码。

source: This function opens the text file with the indicated filename for reading only, returning the unique id of the file that which should be stored in a variable as it will be used for all further actions to do with that file.
zh_cn: 此函数使用指定的文件名打开文本文件以供只读，返回文件的唯一id，该id应存储在一个变量中，因为它将用于对该文件进行的所有进一步操作。

source: This function opens the text file with the indicated filename for writing (if the file does not exist, it is created), returning the unique id of the file that which should be stored in a variable as it will be used for all further actions to do with that file.
zh_cn: 此函数打开带有指定的写入文件名的文本文件(如果文件不存在，则创建它)，返回文件的唯一id，该id应该存储在一个变量中，因为它将用于对该文件进行的所有进一步操作。

source: This function opens the text file with the indicated filename for writing only (if the file does not exist, it is created), returning the unique id of the file that which should be stored in a variable as it will be used for all further actions to do with that file.
zh_cn: 此函数打开带有指定文件名的文本文件，只用于写入(如果文件不存在，则创建它)，返回文件的唯一id，该id应该存储在一个变量中，因为它将用于对该文件进行的所有进一步操作。

source: This function opens up an OS dependent dialog where you can ask the user to post a rating or comment to a particular page.
zh_cn: 此函数打开一个依赖于操作系统的对话框，在这个对话框中，您可以要求用户对特定的页面发布评分或评论。

source: This function overwrites the current top of the matrix stack with the specified matrix.
zh_cn: 此函数用指定的矩阵覆盖矩阵堆栈的当前顶部。

source: This function permits you to go to any room in your game project, whether created using code or in the Asset Browser.
zh_cn: 此函数允许你进入游戏项目中的任何房间，无论是用代码创建的还是在资源浏览器中创建的。

source: This function permits you to use a custom data type for specific vertex format attributes as part of the new vertex format being created.
zh_cn: 此函数允许您使用特定顶点格式属性的自定义数据类型，作为正在创建的新顶点格式的一部分。

source: This function pops the current top matrix off the stack.
zh_cn: 此函数从堆栈中弹出当前的顶矩阵。

source: This function pops the previous GPU state from the stack and applies it.
zh_cn: 此函数从堆栈中弹出之前的GPU状态并应用它。

source: This function prepares a buffer queue for audio.
zh_cn: 此函数为音频准备了一个缓冲队列。

source: This function pushes the specified matrix onto the matrix stack.
zh_cn: 此函数将指定的矩阵推入到矩阵堆栈中。

source: This function removes (or "un-binds") a fixture from an instance or instances.
zh_cn: 此函数从一个或多个实例中删除(或"取消绑定")一个夹具。

source: This function removes whitespace from both ends of a string and returns a new string, without modifying the original string.
zh_cn: 此函数删除字符串两端的空格并返回一个新字符串，而不修改原始字符串。

source: This function removes whitespace from the beginning of a string (left).
zh_cn: 此函数删除字符串开头(左)的空格。

source: This function removes whitespace from the end of a string (right).
zh_cn: 此函数从字符串的末尾(右)删除空白。

source: This function requires a format string using "{x}" (i.e. {0},{1},...) as placeholders and passing the correspondent values as and array of values.
zh_cn: 这个函数需要一个使用“{x}”(即{0}，{1}，…)作为占位符的格式字符串，并将相应的值作为一个值数组传递。

source: This function requires that you supply the pointer to a previously created regular buffer, and a vertex format that should be applied to the copied data.
zh_cn: 此函数要求您提供指向先前创建的常规缓冲区的指针，以及应应用于复制数据的顶点格式。

source: This function resets the draw target and should be called when you no longer wish to use the current shader (set using shader_set()).
zh_cn: 此函数重置绘制目标，当你不再希望使用当前着色器(使用shader_set()设置)时应该调用它。

source: This function returns a 1D array with 4 elements representing the UV coordinates for the image on the texture page, filling in the array with the following values:
zh_cn: 此函数返回一个一维数组，其中有4个元素代表纹理页面上图像的UV坐标，用以下值填充数组:

source: This function returns a DS Map with detailed information about the OS that the game is running on.
zh_cn: 此函数返回一个DS Map，其中包含游戏所运行的操作系统的详细信息。

source: This function returns a new string using a format string with placeholder information and an array of values.
zh_cn: 此函数使用带有占位符信息的格式字符串和一个值数组，返回一个新字符串。

source: This function returns a random number between the specified range, and this return value does not need to be an integer.
zh_cn: 此函数返回指定范围内的随机数，这个返回值不需要是整数。

source: This function returns a special pointer for the font texture page.
zh_cn: 此函数返回字体纹理页面的一个特殊指针。

source: This function returns a special pointer for the sprite texture page.
zh_cn: 此函数返回一个精灵纹理页面的特殊指针。

source: This function returns a special pointer for the surface texture.
zh_cn: 此函数返回一个用于表面纹理的特殊指针。

source: This function returns a special pointer for the tile set texture page.
zh_cn: 此函数返回一个特殊的指针用于平铺设置纹理页面。

source: This function returns a string and not an index, and the name returned will depend on the font being used.
zh_cn: 此函数返回一个字符串而不是一个索引，返回的名称将取决于所使用的字体。

source: This function returns a string containing the character which relates to the input Unicode code for displaying.
zh_cn: 此函数返回一个字符串，该字符串包含与要显示的输入Unicode代码相关的字符。

source: This function returns a string containing the character with raw BYTE value set.
zh_cn: 此函数返回一个字符串，该字符串包含设置了原始字节值的字符。

source: This function returns a string where the "#" symbol has been converted into a new line.
zh_cn: 此函数返回一个字符串，其中的"#"符号已被转换为一个新行。

source: This function returns a string which can then be stored or transferred to another data structure using the ds_list_read() function.
zh_cn: 此函数返回一个字符串，然后可以使用ds_list_read()函数将该字符串存储或传输到另一个数据结构。

source: This function returns a string which can then be stored or transferred to another data structure using the ds_priority_read() function.
zh_cn: 此函数返回一个字符串，然后可以使用ds_priority_read()函数将该字符串存储或传输到另一个数据结构。

source: This function returns a string which can then be stored or transferred to another data structure using the ds_queue_read() function.
zh_cn: 此函数返回一个字符串，然后可以使用ds_queue_read()函数将该字符串存储或传输到另一个数据结构中。

source: This function returns a string which can then be stored or transferred to another data structure using the ds_stack_read() function.
zh_cn: 此函数返回一个字符串，然后可以使用ds_stack_read()函数将该字符串存储或传输到另一个数据结构中。

source: This function returns a string with the two letter Language Code for the OS that is running the game, as set by the ISO639 standard.
zh_cn: 此函数返回一个字符串，包含运行游戏的操作系统的两个字母的语言代码(Language Code)，由ISO639标准设置。

source: This function returns a string with the two or three letter Regional Code for the OS that is running the game, as set by the ISO3166-1 standard.
zh_cn: 此函数返回一个字符串，其中包含运行游戏的操作系统的两到三个字母的地区代码，这是由ISO3166-1标准设置的。

source: This function returns a struct containing fields w,a,s,d,z,x,c,space,up,left,down,right and the corresponding last_?
zh_cn: 此函数返回一个struct，包含字段w,a,s,d,z,x,c,space,up,left,down,right和对应的last_？

source: This function returns a struct containing player_name and avatar_url for the player.
zh_cn: 此函数返回一个包含玩家名字和头像url的结构。

source: This function returns a value between -1 and 1 depending upon the angle of "tilt" of the device.
zh_cn: 此函数根据设备的"倾斜"角度返回一个介于-1到1之间的值。

source: This function returns an array of 16 values, corresponding to the given 4x4 matrix type, where row 1 is elements [0 - 3], row 2 is elements [4 -7], etc... (see the image on the main page).
zh_cn: 此函数返回一个包含16个值的数组，对应于给定的4x4矩阵类型，其中第一行是元素[0 - 3]，第2行是元素[4 -7]，等等……(见主页图片)。

source: This function returns an array of all of the audio emitters linked to a given audio bus.
zh_cn: 此函数返回链接到给定音频总线的所有音频发射器的数组。

source: This function returns an array with the UV coordinates and other data for the texture of the given tile set on the texture page.
zh_cn: 此函数返回一个数组，其中包含纹理页面上给定图块集的UV坐标和其他纹理数据。

source: This function returns an array with the UV coordinates and other data for the texture of the sprite sub-image on the texture page.
zh_cn: 此函数返回纹理页面上精灵子图像纹理的UV坐标和其他数据数组。

source: This function returns an array with the UV coordinates for the font texture on the texture page, filling in the array with the following values:
zh_cn: 此函数返回纹理页面上字体纹理的UV坐标数组，用以下值填充数组:

source: This function returns an id which must be used in all further functions that deal with this DS grid.
zh_cn: 此函数返回一个id，该id必须在所有处理此DS网格的后续函数中使用。

source: This function returns raw y position of the touch on a device.
zh_cn: 此函数返回触摸在设备上的原始y位置。

source: This function returns the Nine Slice struct for a sprite, containing all its Nine Slice properties as set in the Sprite Editor or using sprite_set_nineslice().
zh_cn: 此函数返回sprite的九宫格结构，包含Sprite编辑器中或使用sprite_set_nineslice()设置的所有九宫格属性。

source: This function returns the absolute value of the input argument, so if it's a positive value then it will remain the same, but if it's negative it will be multiplied by -1 to make it positive.
zh_cn: 此函数返回输入参数的绝对值，所以如果它是正的，那么它将保持不变，但如果它是负的，它将乘以-1使其为正。

source: This function returns the amount of blue used to make the given color, with the value being between 0 and 255, where 0 is no blue and 255 is all blue.
zh_cn: 此函数返回用于制作给定颜色的蓝色的数值，值在0到255之间，其中0表示无蓝色，255表示全蓝色。

source: This function returns the amount of blue used to make the given colour, with the value being between 0 and 255, where 0 is no blue and 255 is all blue.
zh_cn: 此函数返回用于制作给定颜色的蓝色的数量，值在0到255之间，其中0表示无蓝色，255表示全蓝色。

source: This function returns the amount of green used to make the given color, with the value being between 0 and 255, where 0 is no green and 255 is all green.
zh_cn: 此函数返回用于制作给定颜色的绿色的数值，值在0到255之间，其中0表示不绿色，255表示全绿色。

source: This function returns the amount of green used to make the given colour, with the value being between 0 and 255, where 0 is no green and 255 is all green.
zh_cn: 此函数返回用于制作给定颜色的绿色的数量，值在0到255之间，其中0表示不绿色，255表示全绿色。

source: This function returns the amount of red used to make the given color, with the value being between 0 and 255, where 0 is no red and 255 is all red.
zh_cn: 这个函数返回用于制作给定颜色的红色的数值，值在0到255之间，其中0表示不红，255表示全红。

source: This function returns the amount of red used to make the given colour, with the value being between 0 and 255, where 0 is no red and 255 is all red.
zh_cn: 此函数返回用于制作给定颜色的红色的数量，值在0到255之间，其中0表示不红，255表示全红。

source: This function returns the audio bus that an emitter is linked to.
zh_cn: 此函数返回发射器链接到的音频总线。

source: This function returns the background colour of the game window.
zh_cn: 此函数返回游戏窗口的背景颜色。

source: This function returns the caption of the window (this is the text that appears on the top of the window, beside its icon) and by default this shows the caption of the room you're currently in.
zh_cn: 此函数返回窗口的标题(这是显示在窗口顶部图标旁边的文本)，默认情况下，它显示您当前所在房间的标题。

source: This function returns the current draw colour which is used for drawing forms, text, primitives and un-textured 3D models.
zh_cn: 此函数返回当前的绘制颜色，用于绘制表单、文本、图元和无纹理的3D模型。

source: This function returns the current gain (volume) set for the given audio emitter, normally between 0 and 1, where 0 is silent and 1 is full volume.
zh_cn: 此函数返回给定音频发射器的当前增益(音量)设置，通常在0和1之间，其中0表示静音，1表示最大音量。

source: This function returns the current pitch value set for the given audio emitter.
zh_cn: 此函数返回给定音频发射器的当前音高值。

source: This function returns the current play position of the given sync group.
zh_cn: 此函数返回给定同步组的当前播放位置。

source: This function returns the current top matrix of the stack, but does not remove it (for that use matrix_stack_pop()).
zh_cn: 此函数返回堆栈的当前顶矩阵，但不删除它(为此使用matrix_stack_pop())。

source: This function returns the current value of the draw alpha, which will range between 0 (fully transparent) and 1 (fully opaque).
zh_cn: 此函数返回绘制alpha的当前值，范围在0(完全透明)和1(完全不透明)之间。

source: This function returns the current velocity along the x axis for the given audio emitter.
zh_cn: 此函数返回给定音频发射器沿x轴的当前速度。

source: This function returns the current velocity along the y axis for the given audio emitter.
zh_cn: 此函数返回给定音频发射器沿y轴的当前速度。

source: This function returns the current velocity along the z axis for the given audio emitter.
zh_cn: 此函数返回给定音频发射器沿z轴的当前速度。

source: This function returns the current x position of the given audio emitter.
zh_cn: 此函数返回给定音频发射器的当前x位置。

source: This function returns the current y position of the given audio emitter.
zh_cn: 此函数返回给定音频发射器的当前y位置。

source: This function returns the current z position of the given audio emitter.
zh_cn: 此函数返回给定音频发射器的当前z位置。

source: This function returns the data type of any given variable as a string.
zh_cn: 此函数将任意给定变量的数据类型作为字符串返回。

source: This function returns the day (from 1 to 31) of the given datetime.
zh_cn: 此函数返回给定datetime的日期(从1到31)。

source: This function returns the day (from 1 to 366) within the year of the given datetime.
zh_cn: 此函数返回给定datetime的年份内的日期(从1到366)。

source: This function returns the direction of a vector formed by the specified components [x1,y1] and [x2,y2] in relation to the fixed x/y coordinates of the room.
zh_cn: 此函数返回由指定分量[x1，y1]和[x2，y2]形成的向量相对于房间的固定x/y坐标的方向。

source: This function returns the directory part of the indicated file name, which normally is the same as the path except for the final backslash.
zh_cn: 此函数返回指定文件名的目录部分，除了最后一个反斜杠之外，它通常与路径相同。

source: This function returns the drive information of the filename.
zh_cn: 此函数返回文件名的驱动器信息。

source: This function returns the extension part of the indicated file name, including the leading dot.
zh_cn: 此函数返回指定文件名的扩展名部分，包括前导点。

source: This function returns the first index at which a given element can be found in the array (or subsection).
zh_cn: 此函数返回可以在数组(或子数组)中找到给定元素的第一个索引。

source: This function returns the first key stored in the DS map.
zh_cn: 此函数返回存储在DS map中的第一个键。

source: This function returns the fractional part of n, that is, the part behind the decimal dot.
zh_cn: 此函数返回n的小数部分，也就是小数点后面的那部分。

source: This function returns the hour of the given datetime value within the year (from the total number of hours for the year, taking into account leap years).
zh_cn: 此函数返回给定datetime值在年内的小时数(从一年的总小时数计算，考虑到闰年)。

source: This function returns the hour of the given datetime value.
zh_cn: 此函数返回给定datetime值的小时值。

source: This function returns the id of the new instance which can then be stored in a variable or used to access that instance.
zh_cn: 此函数返回新实例的id，然后将其存储在变量中或用于访问该实例。

source: This function returns the indicated file name with the extension (including the dot) changed to the new extension.
zh_cn: 此函数返回指定的文件名，其扩展名(包括点)被更改为新的扩展名。

source: This function returns the inverse tangent of an angle y/x, where y = Opposite side of triangle and x = Adjacent side of triangle.
zh_cn: 此函数返回角度y/x的反正切值，其中y =三角形的对边，x =三角形的邻边。

source: This function returns the last key stored in the DS map.
zh_cn: 此函数返回存储在DS map中的最后一个键。

source: This function returns the length of a vector formed by the specified components [x1,y1] and [x2,y2].
zh_cn: 此函数返回由指定分量[x1，y1]和[x2，y2]组成的向量的长度。

source: This function returns the maximum of the input values, of which it can have up to 16.
zh_cn: 此函数返回输入值的最大值，最多可以有16个输入值。

source: This function returns the median of the input values, that is, the middle value.
zh_cn: 此函数返回输入值的中值，也就是中间值。

source: This function returns the minimum of the input values, of which it can have as many as you require (note that more arguments will mean that the function will be slower to parse).
zh_cn: 此函数返回输入值的最小值，它可以有您需要的任意数量的输入值(注意，参数越多意味着函数解析的速度越慢)。

source: This function returns the minute of the given datetime value within the year (from the total number of minutes for the year, taking into account leap years).
zh_cn: 此函数返回给定datetime值在年内的分钟数(从一年的总分钟数计算，考虑到闰年)。

source: This function returns the minute of the given datetime value.
zh_cn: 此函数返回给定datetime值的分钟数。

source: This function returns the month of the given datetime value.
zh_cn: 此函数返回给定datetime值的月份。

source: This function returns the name (as a string) of the currently selected configuration for your game.
zh_cn: 此函数返回当前选择的游戏配置的名称(以字符串形式)。

source: This function returns the name of the next file that satisfies the previously given mask and the attributes (defined by file_find_first()).
zh_cn: 此函数返回满足前面给定的掩码和属性(由file_find_first()定义)的下一个文件的名称。

source: This function returns the next key stored in the DS map after the one specified in the function.
zh_cn: 此函数返回存储在DS map中的下一个密钥，该密钥在函数中指定。

source: This function returns the number of bytes in a string, but you should note that due to their being held as UTF8, this will not be equal to their string length.
zh_cn: 此函数返回一个字符串中的字节数，但是你应该注意到，由于它们被保存为UTF8格式，这将不等于它们的字符串长度。

source: This function returns the number of characters comprising a given string.
zh_cn: 此函数返回组成给定字符串的字符数。

source: This function returns the number of filtered elements.
zh_cn: 此函数返回经过筛选的元素的数量。

source: This function returns the number of mapped elements.
zh_cn: 此函数返回映射元素的数量。

source: This function returns the number of reversed elements.
zh_cn: 此函数返回反转元素的数量。

source: This function returns the number of unique elements.
zh_cn: 此函数返回唯一元素的数量。

source: This function returns the previous key stored in the DS map before the one specified in the function.
zh_cn: 此函数返回存储在DS map中的上一个密钥，该键在函数中指定的键之前。

source: This function returns the raw x position of a touch on the device.
zh_cn: 此函数返回触摸在设备上的原始x位置。

source: This function returns the relative offset for the x-axis of the origin based on the upper left corner being the 0,0 position, with a +x being right and a -x being left of this.
zh_cn: 此函数基于左上角为0，0位置，返回原点x轴的相对偏移量，其中a +x在此位置的右侧，a -x在此位置的左侧。

source: This function returns the relative offset for the y-axis of the origin based on the upper left corner being the 0,0 position, with a +y being down and a -y being up from this.
zh_cn: 此函数基于左上角为0，0位置，返回原点的y轴的相对偏移量，其中+y向下，a -y向上。

source: This function returns the relative position of the bottom of the sprite bounding box.
zh_cn: 此函数返回精灵边界框底部的相对位置。

source: This function returns the relative position of the left of the sprite bounding box.
zh_cn: 此函数返回精灵边界框左边的相对位置。

source: This function returns the relative position of the right of the sprite bounding box.
zh_cn: 此函数返回精灵边界框右边的相对位置。

source: This function returns the relative position of the top of the sprite bounding box.
zh_cn: 此函数返回精灵边界框顶部的相对位置。

source: This function returns the script function index of the function assigned to run at the end of rendering the given layer, or it will return -1 if no function is assigned.
zh_cn: 此函数返回指定在渲染给定层结束时运行的函数的脚本函数索引，如果没有指定函数，则返回-1。

source: This function returns the second of the given datetime value within the year (from the total number of seconds for the year, taking into account leap years).
zh_cn: 此函数返回一年中给定日期时间值的秒(从一年的总秒数中，考虑闰年)。

source: This function returns the second of the given datetime value.
zh_cn: 此函数返回给定日期时间值的秒。

source: This function returns the speed factor of any given position on a path.
zh_cn: 此函数返回路径上任何给定位置的速度乘数。

source: This function returns the time that your game has been running on the chosen platform in microseconds (there are 1 million microseconds per second).
zh_cn: 此函数返回游戏在所选平台上运行的时间，单位为微秒(每秒一百万微秒)。

source: This function returns the value (a string) of the environment variable with the given name (also a string).
zh_cn: 此函数返回具有给定名称(也是字符串)的环境变量的值(字符串)。

source: This function returns the week day value of the given datetime.
zh_cn: 此函数返回给定日期时间的星期值。

source: This function returns the week of the given datetime value within the year.
zh_cn: 此函数返回一年中给定日期时间值的星期。

source: This function returns the x position of a touch on the device.
zh_cn: 此函数返回触摸在设备上的x位置。

source: This function returns the x position of the touch on the device in relation to the GUI layer.
zh_cn: 此函数返回设备上触摸相对于GUI层的x位置。

source: This function returns the x-coordinate of the mouse with respect to all the active views and returns the same value mouse_x.
zh_cn: 此函数返回鼠标相对于所有活动视图的x坐标，并返回相同的值mouse_x。

source: This function returns the y position of a touch on the device.
zh_cn: 此函数返回设备上触摸的y位置。

source: This function returns the y position of the touch on the device in relation to the GUI layer.
zh_cn: 此函数返回设备上触摸相对于GUI层的y位置。

source: This function returns the y-coordinate of the mouse with respect to all the active views and returns the same value mouse_y.
zh_cn: 此函数返回鼠标相对于所有活动视图的y坐标，并返回相同的值mouse_y。

source: This function returns the year of the given datetime.
zh_cn: 此函数返回给定日期时间的年份。

source: This function returns true if the mouse wheel is being rotated downwards and false otherwise.
zh_cn: 如果鼠标滚轮向下旋转，此函数返回true，否则返回false。

source: This function returns true if the mouse wheel is being rotated upwards and false otherwise.
zh_cn: 如果鼠标滚轮向上旋转，此函数返回true，否则返回false。

source: This function returns true or false depending on whether the device that you specify has been "touched" (clicked) or not.
zh_cn: 此函数根据您指定的设备是否被"触摸"(点击)返回true或false。

source: This function returns true or false depending on whether the device touch that you specify has been released or not.
zh_cn: 此函数根据指定的设备触摸是否被释放返回true或false。

source: This function returns true when the end of a given opened text file has been reached or false if not.
zh_cn: 当到达给定打开文本文件的末尾时，此函数返回true，否则返回false。

source: This function returns true or false depending on whether the given mouse button is being held down on the given device.
zh_cn: 此函数根据给定设备上的给定鼠标按钮是否被按住而返回true或false。

source: This function returns various pieces of information about a group of particles in the physics simulation using the given flags checked.
zh_cn: 此函数使用检查的给定标志返回物理模拟中一组粒子的各种信息。

source: This function returns various pieces of information about a single particle in the physics simulation using the given flags checked.
zh_cn: 此函数使用选中的给定标志返回物理模拟中单个粒子的各种信息。

source: This function returns various pieces of information about each particle in the physics simulation using the given flags checked.
zh_cn: 此函数返回关于物理模拟中每个粒子的不同信息片段，使用给定的标记。

source: This function returns whether a clickable DOM icon has been created with the specified index exists or not.
zh_cn: 此函数返回可点击的DOM图标是否已经创建了指定的索引。

source: This function returns whether a font with the specified index exists or not.
zh_cn: 此函数返回具有指定索引的字体是否存在。

source: This function returns whether a given variable is NaN (not a number) or not, returning true if it is, and false if it is not.
zh_cn: 此函数返回给定变量是否为NaN(不是数字)，如果是则返回true，如果不是则返回false。

source: This function returns whether a given variable is a 32bit integer or not.
zh_cn: 此函数返回给定变量是否为32位整数。

source: This function returns whether a given variable is a 64bit integer or not.
zh_cn: 此函数返回给定变量是否为64位整数。

source: This function returns whether a given variable is a boolean (true ior false) or not.
zh_cn: 此函数返回给定变量是否为布尔值(true或false)。

source: This function returns whether a given variable is a numeric value (real, int32, int64 or boolean) or not.
zh_cn: 此函数返回给定变量是否为数值(real, int32, int64 or boolean)。

source: This function returns whether a given variable is a pointer or not.
zh_cn: 此函数返回给定变量是否是指针。
